clc;clear;
%%%以中心轴线将切割索型面一分为二，该程序用于生成半张切割索型面
%%%切割索内层铅皮（聚能槽）函数为y=a1+a2x+a3x^2+a4^3
%%%切割索内层铅皮（背部）函数为y=a5+a6x+a7x^2+a8^3
%%%切割索外层铅皮（聚能槽）函数为y=a9+a10x+a11x^2+a12^3
%%%切割索外层铅皮（背部）函数为y=a13+a14x+a15x^2+a16^3
%%%增加聚能槽和背部铅皮厚度约束，以及宽度交点约束
%%%m为切割索内层铅皮宽度一半
m=-1.3;
%%%m1为切割索外层铅皮宽度一半
m1=-2.4;
%%%s为切割索内层铅皮面积
s=1.2183;
%%%m1为切割索外层铅皮面积
s1=8.1;
%%%定义切割索装药面高度
H=0.5;
%%%设定铅皮宽度m2，用来定义聚能槽内外铅皮厚度差H1；背部铅皮内外铅皮厚度差H2；
m2=0.5;
H1=0.2;
H2=0.65;
%%%设定聚能槽铅皮与中心轴线的夹角;
J=80;
%%%设定切割索背部铅皮与中心轴线的夹角
J1=40;
n=cot(J/180*pi);
t=cot(J1/180*pi);
%%%在满足 A*x ≤ b 的情况下基于最小二乘思想求解线性方程组 C*x = d，增加线性等式约束 Aeq*x = beq
%%%%（a5-a1）+（a6-a2）m+（a7-a3）m^2+（a8-a4）m^3=0
%%%% a2*m+a3*m^2+a4*m^3=m*cot(phi)
%%%% a6*m+a7*m^2+a8*m^3=m*cot(phi)
%%%% 0- 2[（a5-a1）m+（a6-a2）m^2/2+（a7-a3）m^3/3+（a8-a4）m^4/4]=S
%%%%（a13-a9）+（a14-a10）m+（a15-a11）m^2+（a16-a12）m^3=0
%%%% a10*m+a11*m^2+a12*m^3=m*cot(phi)
%%%% a14*m+a15*m^2+a16*m^3=m*cot(phi)
%%%% 0- 2[（a13-a9）m+（a14-a10）m^2/2+（a15-a11）m^3/3+（a16-a12）m^4/4]=S
c = [1 m m^2 m^3 -1 -m -m^2 -m^3 0 0 0 0 0 0 0 0;0 m m^2 m^3 0 0 0 0 0 0 0 0 0 0 0 0;0 0 0 0 0 m m^2 m^3 0 0 0 0 0 0 0 0;m m^2/2 m^3/3 m^4/4 -m -m^2/2 -m^3/3 -m^4/4 0 0 0 0 0 0 0 0;0 0 0 0 0 0 0 0 1 m1 m1^2 m1^3 -1 -m1 -m1^2 -m1^3;0 0 0 0 0 0 0 0 0 m1 m1^2 m1^3 0 0 0 0;0 0 0 0 0 0 0 0 0 0 0 0 0 m1 m1^2 m1^3;0 0 0 0 0 0 0 0 m1 m1^2/2 m1^3/3 m1^4/4 -m1 -m1^2/2 -m1^3/3 -m1^4/4];
d = [0;n*m;t*m;s/2;0;n*m1;t*m1;s1/2];
%%%% a2+2*a3*m+3*a4*m^2(m=0)≥0
%%%% a2+2*a3*m+3*a4*m^2<0
%%%% a6+2*a7*m+3*a8*m^2(m=0)≥0
%%%% a6+2*a7*m+3*a8*m^2<0
%%%% a1+a2*x+a3*x^2+a4*x^3-(a5+a6*x+a7*x^2+a8*x^3)<0
%%%% a5-a1>0.5 %%%装药面高度＞0.5
%%%% a10+2*a11*m+3*a12*m^2(m=0)≥0
%%%% a10+2*a11*m+3*a12*m^2<0
%%%% a14+2*a15*m+3*a16*m^2(m=0)≥0
%%%% a14+2*a15*m+3*a16*m^2<0
%%%% a9+a10*x+a11*x^2+a12*x^3-(a13+a14*x+a15*x^2+a16*x^3)<0
A=[0 1 2*m 3*m^2 0 0 0 0 0 0 0 0 0 0 0 0;0 0 0 0 0 -1 -2*m -3*m^2 0 0 0 0 0 0 0 0;1 0 0 0 -1 0 0 0 0 0 0 0 0 0 0 0;0 -1 0 0 0 0 0 0 0 0 0 0 0 0 0 0;0 0 0 0 0 -1 0 0 0 0 0 0 0 0 0 0;0 0 0 0 0 0 0 0 0 1 2*m1 3*m1^2 0 0 0 0;0 0 0 0 0 0 0 0 0 0 0 0 0 -1 -2*m1 -3*m1^2;0 0 0 0 0 0 0 0 1 0 0 0 -1 0 0 0;0 0 0 0 0 0 0 0 0 -1 0 0 0 0 0 0;0 0 0 0 0 0 0 0 0 0 0 0 0 -1 0 0;1 0 0 0 -1 0 0 0 0 0 0 0 0 0 0 0];
b=[0 0 0 0 0 0 0 0 0 0 -H];
%%%%%%%%%取x=0时导数为0,增加聚能槽和背部签批厚度约束,装药面积
%%%% a2=0 a10=0
%%%% a6=0 a14=0
%%%% a1-a9=0.2
%%%% a1+a2*m2+a3*m2^2+a4*m3-(a9+a10*m2+a11*m2^2+a12*m3)=0.2
%%%% a13-a5=0.65
%%%% a13+a14*m2+a15*m2^2+a16*m3-(a5+a6*m2+a7*m2^2+a8*m3)=0.65
%%%%（a5-a1）+（a6-a2）m+（a7-a3）m^2+（a8-a4）m^3=0
%%%%（a13-a9）+（a14-a10）m1+（a15-a11）m1^2+（a16-a12）m1^3=0
%%%% 0- 2[（a5-a1）m+（a6-a2）m^2/2+（a7-a3）m^3/3+（a8-a4）m^4/4]=S
Aq=[0 1 0 0 0 0 0 0 0 0 0 0 0 0 0 0;0 0 0 0 0 1 0 0 0 0 0 0 0 0 0 0;0 0 0 0 0 0 0 0 0 1 0 0 0 0 0 0;0 0 0 0 0 0 0 0 0 0 0 0 0 1 0 0;1 0 0 0 0 0 0 0 -1 0 0 0 0 0 0 0;1 m2 m2^2 m2^3 0 0 0 0 -1 -m2 -m2^2 -m2^3 0 0 0 0;0 0 0 0 -1 0 0 0 0 0 0 0 1 0 0 0;0 0 0 0 -1 -m2 -m2^2 -m2^3 0 0 0 0 1 m2 m2^2 m2^3;1 m m^2 m^3 -1 -m -m^2 -m^3 0 0 0 0 0 0 0 0;0 0 0 0 0 0 0 0 1 m1 m1^2 m1^3 -1 -m1 -m1^2 -m1^3;m m^2/2 m^3/3 m^4/4 -m -m^2/2 -m^3/3 -m^4/4 0 0 0 0 0 0 0 0];
bq=[0 0 0 0 H1 H1 H2 H2 0 0 s/2];
% lb =-1*ones(size(A,2),1); % 定义下界
% lb=zeros(size(A,2),1); % 定义下界
% 求解最小二乘问题
% x = lsqlin(c, d, A, b, [], [],lb)
% x = lsqlin(c, d, A, b, [], [])
x = lsqlin(c, d, A, b, Aq, bq)
z=x(1)+x(2)*m+x(3)*m^2+x(4)*m^3-x(5)-x(6)*m-x(7)*m^2-x(8)*m^3;
I=-1.3:0.01:0;
y1=x(1)+x(2)*I+x(3)*I.^2+x(4)*I.^3;
y2=x(5)+x(6)*I+x(7)*I.^2+x(8)*I.^3;
Z=x(9)+x(10)*m1+x(11)*m1^2+x(12)*m1^3-x(13)-x(14)*m1-x(15)*m1^2-x(16)*m1^3;
J=-2.4:0.01:0;
g1=x(9)+x(10)*J+x(11)*J.^2+x(12)*J.^3;
g2=x(13)+x(14)*J+x(15)*J.^2+x(16)*J.^3;
plot(I,y1,I,y2,J,g1,J,g2)
xlswrite('example.xls', x)
y3=x(1)+x(2)*m+x(3)*m^2+x(4)*m^3;
Q1=acot((y3-x(1))/m)/pi*180
Q2=acot((y3-x(5))/m)/pi*180
g3=x(9)+x(10)*m1+x(11)*m1^2+x(12)*m1^3;
Q3=acot((g3-x(9))/m1)/pi*180
Q4=acot((g3-x(13))/m1)/pi*180
% plot(I,y1,I,y2)
% xlswrite('example.xls', x)
